---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesWerePushed
source: html/4e085ac4-4e7e-072c-b9ef-52a07fc9ec7c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CurtainWallFailures.GridlinesWerePushed Property

Panels and mullions created by a curtain grid were created with slight inaccuracies.

## Syntax (C#)
```csharp
public static FailureDefinitionId GridlinesWerePushed { get; }
```